<!-- dflook/terraform-github-actions {"workspace":"dev-dev-deploy","backend_type":"remote","backend":"0dd52039d936a7e1d5025a8a4d08a2edb19c1f8a40406c06dd09dde4084f97a6","plan_job_ref":"Job Create Dev Deployment #41 at https://github.com/scidsg/hushline/actions/runs/9720360774","plan_out_hash":"3e3066330ff617e1e737ae74fb2496d101465af832d031bc7a4fa760de05417a","plan_hash":"9193d6962a8729c00345b69d4c0e024d30fa7dc44aa8e9acbaddeed22f47c604","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __terraform/dev__ in the __dev-dev-deploy__ workspace<details open><summary>With variables</summary>

```hcl
name = "hushline-dev-deploy"
tag  = "latest"
```
</details>
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.app.digitalocean_app.app will be created
+   resource "digitalocean_app" "app" {
+       active_deployment_id = (known after apply)
+       created_at           = (known after apply)
+       default_ingress      = (known after apply)
+       id                   = (known after apply)
+       live_url             = (known after apply)
+       project_id           = (known after apply)
+       updated_at           = (known after apply)
+       urn                  = (known after apply)

+       dedicated_ips (known after apply)

+       spec {
+           domains = (known after apply)
+           name    = "hushline-dev-deploy"
+           region  = "sfo"

+           alert {
+               disabled = false
+               rule     = "DEPLOYMENT_FAILED"
            }

+           database {
+               engine     = "PG"
+               name       = "db"
+               production = false
            }

+           domain (known after apply)

+           ingress (known after apply)

+           service {
+               http_port          = 8080
+               instance_count     = 1
+               instance_size_slug = "apps-s-1vcpu-0.5gb"
+               internal_ports     = (known after apply)
+               name               = "hushline"
+               run_command        = (known after apply)

+               health_check {
+                   http_path = "/health.json"
                }

+               image {
+                   registry      = "scidsg"
+                   registry_type = "GHCR"
+                   repository    = "hushline/hushline"
+                   tag           = "latest"

+                   deploy_on_push (known after apply)
                }

+               routes (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create Dev Deployment #41](https://github.com/scidsg/hushline/actions/runs/9720360774)